readme modifyed
